<img src="http://www.reeem.org/wp-content/uploads/2017/10/cropped-reeem-logo-transparent.png" width="300" style="float: left">
<img src="http://reiner-lemoine-institut.de//wp-content/uploads/2015/09/rlilogo.png" width="100" style="float: right">

# REEEM-DB - NEWAGE

__copyright__ 	= "© Reiner Lemoine Institut" <br>
__license__ 	= "GNU Affero General Public License Version 3 (AGPL-3.0)" <br>
__url__ 		= "https://www.gnu.org/licenses/agpl-3.0.en.html" <br>
__author__ 		= "Ludwig Hülk"

# Import

In [1]:
# basic
import sys
import os
import getpass
import pandas as pd
import numpy as np
import json
import pathlib
from sqlalchemy import *
# plot
import matplotlib.pyplot as plt
import matplotlib.ticker as mticker
import plotly.graph_objs as go
import plotly.offline as pltly
import colorlover as cl
import seaborn as sns
# notebook
from IPython.display import Image
from IPython.core.display import HTML 

pltly.init_notebook_mode(connected=True)
%matplotlib inline

version = 'v0.2.0'
project = 'REEEM'

# Database Connection

This function creates a database connection to the **reeem_db**.<br>
The default user is **reeem_vis**, a user that has only read rights.

This section establishes the database connection and asks for the **password**.<br>
The username can be changed in the corresponding function above.<br>
If you don't have a username or forgot your password please contact your database admins.

In [2]:
def reeem_session():
    """SQLAlchemy session object with valid connection to reeem database"""
    
    print('Please provide connection parameters to database:\n' +
              'Hit [Enter] to take defaults')
    host = '130.226.55.43' # input('host (default 130.226.55.43): ')
    port = '5432' # input('port (default 5432): ')
    database = 'reeem' # input("database name (default 'reeem'): ")
    user = 'reeem_vis' # input('user (default postgres): ')
    # password = input('password: ')
    password = getpass.getpass(prompt='password: ',
                                   stream=sys.stderr)
    con = create_engine(
            'postgresql://' + '%s:%s@%s:%s/%s' % (user,
                                                  password,
                                                  host,
                                                  port,
                                                  database)).connect()
    print('Password correct! Database connection established.')
    return con

con = reeem_session()

C:\Anaconda3\envs\reeem-vis\lib\site-packages\ipykernel_launcher.py:12: UserWarning:

The `stream` parameter of `getpass.getpass` will have no effect when using ipykernel

Please provide connection parameters to database:
Hit [Enter] to take defaults
password: ········
Password correct! Database connection established.

# Table Info

In [3]:
# Database
schema = 'model_draft'
table_in = 'reeem_newage_input'
table_out = 'reeem_newage_output'
folder = 'newage'

pathlib.Path('data/'+folder).mkdir(parents=True, exist_ok=True) 
print("Database Schema:", schema +'\n'+ "Input table:", table_in +'\n'+ 
      "Output table:", table_out +'\n'+ "Created folder:", folder )

Database Schema: model_draft
Input table: reeem_newage_input
Output table: reeem_newage_output
Created folder: newage

## Database Query

This section is used to query the database tables (**table_in** and **table_out**).<br>

In [4]:
# Number of entries in table
sql = text("""
    SELECT  'In' AS data, count(*) AS count
    FROM    {0}.{1}
    UNION ALL
    SELECT  'Out' AS data, count(*) AS count
    FROM    {0}.{2}""".format(schema, table_in, table_out))
df_num = pd.read_sql_query(sql, con)
df_num

  data   count
0   In       0
1  Out  632792

In [5]:
# Pathways
column = 'pathway' # id, pathway, version, region, year, indicator, category, value, unit
sql = text("""
    SELECT  'In' AS data, {3}, count(*) AS count
    FROM    {0}.{1}
    GROUP BY {3} 
    UNION ALL 
    SELECT  'Out' AS data, {3}, count(*) AS count
    FROM    {0}.{2}
    GROUP BY {3} 
    ORDER BY {3}; """.format(schema, table_in, table_out, column))
df_path = pd.read_sql_query(sql, con)
df_path

  data pathway   count
0  Out   pilot  632792

In [6]:
# Versions
column = 'pathway,version' # id, pathway, version, region, year, indicator, category, value, unit
sql = text("""
    SELECT  'In' AS data, {3}, count(*) AS count
    FROM    {0}.{1}
    GROUP BY {3} 
    UNION ALL 
    SELECT  'Out' AS data, {3}, count(*) AS count
    FROM    {0}.{2}
    GROUP BY {3} 
    ORDER BY {3}; """.format(schema, table_in, table_out, column))
df_ver = pd.read_sql_query(sql, con)
df_ver

  data pathway version   count
0  Out   pilot  DataV1  632792

In [7]:
# Years
column = 'year' # id, pathway, version, region, year, indicator, category, value, unit
sql = text("""
    SELECT  'In' AS data, {3}, count(*) AS count
    FROM    {0}.{1}
    GROUP BY {3} 
    UNION ALL 
    SELECT  'Out' AS data, {3}, count(*) AS count
    FROM    {0}.{2}
    GROUP BY {3} 
    ORDER BY {3} ; """.format(schema, table_in, table_out, column))
df_year = pd.read_sql_query(sql, con)
df_year

  data  year  count
0  Out  2011  70301
1  Out  2015  70285
2  Out  2020  70285
3  Out  2025  70309
4  Out  2030  70322
5  Out  2035  70322
6  Out  2040  70322
7  Out  2045  70322
8  Out  2050  70324

In [8]:
# Regions
column = 'region' # id, pathway, version, region, year, indicator, category, value, unit
sql = text("""
    SELECT  'In' AS data, {3}, count(*) AS count
    FROM    {0}.{1}
    GROUP BY {3}
    UNION ALL 
    SELECT  'Out' AS data, {3}, count(*) AS count
    FROM    {0}.{2}
    GROUP BY {3}; """.format(schema, table_in, table_out, column))
df_reg = pd.read_sql_query(sql, con)
df_reg

   data region  count
0   Out    DEU  31590
1   Out    ITA  31590
2   Out    OPA  31734
3   Out    ESP  31590
4   Out    UKI  31590
5   Out  World  31347
6   Out    POL  31590
7   Out    OEC  31734
8   Out    BNL  31590
9   Out    CHI  31734
10  Out    ROW  31718
11  Out    IND  31734
12  Out    BRZ  31702
13  Out    USA  31734
14  Out    EUS  31590
15  Out    RSA  31734
16  Out    FRA  31590
17  Out    EUN  31590
18  Out   EU28  31638
19  Out    RUS  31673

In [9]:
# Categories
column = 'category' # id, pathway, version, region, year, indicator, category, value, unit
sql = text("""
    SELECT  'In' AS data, {3}, count(*) AS count
    FROM    {0}.{1}
    GROUP BY {3} 
    UNION ALL 
    SELECT  'Out' AS data, {3}, count(*) AS count
    FROM    {0}.{2}
    GROUP BY {3}; """.format(schema, table_in, table_out, column))
df_cat = pd.read_sql_query(sql, con)
df_cat

   data                        category  count
0   Out    secondary energy,electricity  58320
1   Out            emissions,co2,energy  58320
2   Out       GVA,unskilled labor,share  82620
3   Out                         imports  43740
4   Out               gross value added  87480
5   Out                   trade balance  43740
6   Out                      employment  14580
7   Out  revealed comparative advantage  43740
8   Out                         economy   9234
9   Out         final energy,electricty  19440
10  Out                    price,carbon   1478
11  Out         GVA,skilled labor,share  82620
12  Out                         exports  43740
13  Out      relative world trade share  43740

In [10]:
# Indicators
column = 'nid,category,indicator' # id, pathway, version, region, year, indicator, category, value, unit
sql = text("""
    SELECT  'In' AS data, {3}, count(*) AS count
    FROM    {0}.{1}
    GROUP BY {3} 
    UNION ALL 
    SELECT  'Out' AS data, {3}, count(*) AS count
    FROM    {0}.{2}
    GROUP BY {3}
    ORDER BY category, indicator, nid; """.format(schema, table_in, table_out, column))
df_ind = pd.read_sql_query(sql, con)
df_ind.index.names = ['rid']
df_ind

,data,nid,category,indicator,count
rid,,,,,
0,Out,None,economy,gdp.mer,4860
1,Out,None,economy,welfare,4374
2,Out,None,"emissions,co2,energy",co2.energy.esd,4860
3,Out,None,"emissions,co2,energy",co2.energy.esd.agriculture,4860
4,Out,None,"emissions,co2,energy",co2.energy.esd.civil_construction,4860
5,Out,None,"emissions,co2,energy",co2.energy.esd.comercial,4860
6,Out,None,"emissions,co2,energy",co2.energy.esd.industry,4860
7,Out,None,"emissions,co2,energy",co2.energy.esd.residential,4860
8,Out,None,"emissions,co2,energy",co2.energy.esd.transportation,4860
9,Out,None,"emissions,co2,energy",co2.energy.ets,4860
10,Out,None,"emissions,co2,energy",co2.energy.ets.electricity,4860
11,Out,None,"emissions,co2,energy",co2.energy.ets.industry,4860
12,Out,None,"emissions,co2,energy",co2.energy.ets.oil_refinery,4860
13,Out,None,"emissions,co2,energy",co2.energy.total,4860
14,Out,None,employment,employment.skilled,4860
15,Out,None,employment,employment.total,4860
16,Out,None,employment,employment.unskilled,4860
17,Out,None,exports,exports.chemistry,4860
18,Out,None,exports,exports.food_tobacco,4860
19,Out,None,exports,exports.iron_steel,4860
20,Out,None,exports,exports.machinery,4860
21,Out,None,exports,exports.motor_vehicles,4860
22,Out,None,exports,exports.non_ferrous_metals,4860
23,Out,None,exports,exports.non_metallic_minerals,4860
24,Out,None,exports,exports.paper_pulp_print,4860
25,Out,None,exports,exports.rest_of_industry,4860
26,Out,None,"final energy,electricty",electricity.consumption.comercial,4860
27,Out,None,"final energy,electricty",electricity.consumption.industry,4860
28,Out,None,"final energy,electricty",electricity.consumption.residential,4860
29,Out,None,"final energy,electricty",electricity.consumption.transportation,4860
...,...,...,...,...,...
103,Out,None,revealed comparative advantage,rca.chemistry,4860
104,Out,None,revealed comparative advantage,rca.food_tobacco,4860
105,Out,None,revealed comparative advantage,rca.iron_steel,4860
106,Out,None,revealed comparative advantage,rca.machinery,4860
107,Out,None,revealed comparative advantage,rca.motor_vehicles,4860
108,Out,None,revealed comparative advantage,rca.non_ferrous_metals,4860
109,Out,None,revealed comparative advantage,rca.non_metallic_minerals,4860
110,Out,None,revealed comparative advantage,rca.paper_pulp_print,4860
111,Out,None,revealed comparative advantage,rca.rest_of_industry,4860
112,Out,None,"secondary energy,electricity",electricity.production.biomass,4860
113,Out,None,"secondary energy,electricity",electricity.production.ccs,4860
114,Out,None,"secondary energy,electricity",electricity.production.gas,4860
115,Out,None,"secondary energy,electricity",electricity.production.geothermal,4860
116,Out,None,"secondary energy,electricity",electricity.production.hard_coal,4860
117,Out,None,"secondary energy,electricity",electricity.production.hydro,4860
118,Out,None,"secondary energy,electricity",electricity.production.lignite,4860
119,Out,None,"secondary energy,electricity",electricity.production.nuclear,4860
120,Out,None,"secondary energy,electricity",electricity.production.oil,4860
121,Out,None,"secondary energy,electricity",electricity.production.solar,4860
122,Out,None,"secondary energy,electricity",electricity.production.total,4860
123,Out,None,"secondary energy,electricity",electricity.production.wind,4860
124,Out,None,trade balance,trd.chemistry,4860
125,Out,None,trade balance,trd.food_tobacco,4860
126,Out,None,trade balance,trd.iron_steel,4860
127,Out,None,trade balance,trd.machinery,4860
128,Out,None,trade balance,trd.motor_vehicles,4860
129,Out,None,trade balance,trd.non_ferrous_metals,4860
130,Out,None,trade balance,trd.non_metallic_minerals,4860
131,Out,None,trade balance,trd.paper_pulp_print,4860
132,Out,None,trade balance,trd.rest_of_industry,4860

In [11]:
# Write data as CSV file
csvname = 'data/{0}/reeem_{0}_indicators.csv'.format(folder)
df_ind.to_csv(csvname, sep=';')
print("Data saved to file:", csvname)

Data saved to file: data/newage/reeem_newage_indicators.csv

## Table metadata

Access the metadata from the database tables and write metadata string as JSON file.<br>

In [12]:
# Input Metadata
sql = text("""SELECT obj_description('{0}.{1}'::regclass);""".format(schema, table_in))
meta_in = pd.read_sql_query(sql, con).loc[:,'obj_description'].iloc[0]
print(meta_in)

# Save data to JSON file
fname_in = 'data/{0}/{1}_metadata.json'.format(folder, table_in)
with open(fname_in, 'w') as metafile:
    json.dump(json.loads(meta_in), metafile, indent=4)
    print("Data saved to file:", fname_in)

None

TypeError: the JSON object must be str, bytes or bytearray, not 'NoneType'

In [13]:
# Output Metadata
sql = text("""SELECT obj_description('{0}.{1}'::regclass);""".format(schema, table_out))
meta_out = pd.read_sql_query(sql, con).loc[:,'obj_description'].iloc[0]
print(meta_out)

# Save data to JSON file
fname_out = 'data/{0}/{1}_metadata.json'.format(folder, table_out)
with open(fname_out, 'w') as metafile:
    json.dump(json.loads(meta_out), metafile, indent=4)
    print("Data saved to file:", fname_out)

{
    "title": "NEWAGE Output",
    "description": "Example data from NEWAGE model",
    "language": [ "eng" ],
    "spatial":
        {"location": "none",
        "extent": "gloabal",
        "resolution": "country"},
    "temporal":
        {"reference_date": "none",
        "start": "2011",
        "end": "2050",
        "resolution": "5 years"},
    "sources": [
        {"name": "", "description": "", "url": "", "license": "", "copyright": ""} ],
    "license":
        {"id": "tba",
        "name": "tba",
        "version": "tba",
        "url": "tba",
        "instruction": "tba",
        "copyright": "tba"},
    "contributors": [
        {"name": "Ludwig Hülk", "email": "ludwig.huelk@rl-institut.de", "date": "2017-07-24", "comment": "Create table"} ],
    "resources": [
        {"name": "model_draft.reeem_newage_output",
        "format": "PostgreSQL",
        "fields": [
            {"name": "id", "description": "Unique identifier", "unit": "none"},
            {"name": "nid", "description": "Row id", "unit": "none"},
            {"name": "pathway", "description": "REEEM pathway", "unit": "none"},
            {"name": "framework", "description": "REEEM framework", "unit": "none"},
            {"name": "version", "description": "REEEM version", "unit": "none"},
            {"name": "region", "description": "Country or region", "unit": "none"},
            {"name": "scenario", "description": "Scenario", "unit": "none"},
            {"name": "year", "description": "Year", "unit": "none"},
            {"name": "category", "description": "2. classification", "unit": "none"},
            {"name": "indicator", "description": "Parameter name", "unit": "none"},
            {"name": "value", "description": "Parameter value", "unit": "unit"},
            {"name": "unit", "description": "Parameter unit", "unit": "none"},
            {"name": "aggregation", "description": "True if aggregated", "unit": "none"},
            {"name": "tags", "description": "Free classification", "unit": "none"},
            {"name": "updated", "description": "Timestamp", "unit": "none"} ] } ],
    "metadata_version": "1.3"}
Data saved to file: data/newage/reeem_newage_output_metadata.json